mokebs.forEach((m, i) => {

  if (m.name === "موکب شهرداری") {
    m.lat = 35.49687;
    m.lng = 51.52613;
    return;
  }

  if (m.name === "فرمانداری، بخشداری و دهیاری‌ها") {
    m.lat = 35.46200;
    m.lng = 51.55749;
    return;
  }

  const index = Math.floor(
    (i * (route.length - 1)) / (mokebs.length - 1)
  );

  const point = route[index];

  m.lat = point[0];
  m.lng = point[1];

});
const map = L.map('map').setView([35.52198,51.49887],12);

L.tileLayer(
'https://tile.openstreetmap.org/{z}/{x}/{y}.png'
).addTo(map);

const start=[35.44054,51.57129];

// مقصد جدید: حرم شاه عبدالعظیم حسنی
const destination=[35.58518,51.43778];

const mokebs=[
  {
    "name": "قعله نو نرسید به کلانتری ",
    "type": "پذیرایی",
    "address": "مسیر پیاده روی جاماندگان اربعین",
    "services": "ظرفیت صبحانه آب هندونه ۲۰۰۰۰۰",
    "phone": "۰۹۱۰۰۷۴۴۸۰۳"
  },
  {
    "name": "موکب امام رضا ع\nکانون خدمت رضوی ",
    "type": "پذیرایی",
    "address": "مسیر پیاده روی جاماندگان اربعین",
    "services": "ظرفیت ۳۰۰۰",
    "phone": "۰۹۱۰۶۷۴۵۱۷۷"
  },
  {
    "name": "موکب امام رضا ع",
    "type": "پذیرایی",
    "address": "مسیر پیاده روی جاماندگان اربعین",
    "services": "ظرفیت مجید بیرامی",
    "phone": "۰۹۱۰۶۷۴۵۱۷۷"
  },
  {
    "name": "حضرت علی اصغر",
    "type": "پذیرایی",
    "address": "مسیر پیاده روی جاماندگان اربعین",
    "services": "ظرفیت صبحانه الویه۷۰۰عددهندوانه ۲۰۰۰هزارکیلو آب شربت به مقدار کافی ",
    "phone": "۰۹۱۰۰۷۴۴۸۰۳"
  },
  {
    "name": "جوانان حضرت علی اصغر",
    "type": "پذیرایی",
    "address": "مسیر پیاده روی جاماندگان اربعین",
    "services": "ظرفیت ۱۱۱۱",
    "phone": "09029825654"
  },
  {
    "name": "پایگاه شهید حسن تاجیک \nمسجد صاحب الزمان ",
    "type": "پذیرایی",
    "address": "مسیر پیاده روی جاماندگان اربعین",
    "services": "ظرفیت 2 تا 3 هزار نفر",
    "phone": "09307036986"
  },
  {
    "name": "موکب قمر بنی هاشم",
    "type": "پذیرایی",
    "address": "مسیر پیاده روی جاماندگان اربعین",
    "services": "ظرفیت ۴۰۰۰۰",
    "phone": "۰۹۳۶۵۴۲۴۵۲۴"
  },
  {
    "name": "موکب جاماندگان اربعین حسینیه سیدالشهداباقرابادخیابان مافی اباد",
    "type": "پذیرایی",
    "address": "مسیر پیاده روی جاماندگان اربعین",
    "services": "ظرفیت ۳۰۰۰",
    "phone": "۰۹۳۰۳۸۲۰۸۳۲"
  },
  {
    "name": "فاطمه الزهرا شهید ستاری قرچک",
    "type": "پذیرایی",
    "address": "مسیر پیاده روی جاماندگان اربعین",
    "services": "ظرفیت 10000",
    "phone": "09353633220"
  },
  {
    "name": "جوانان حضرت علی اصغر ",
    "type": "پذیرایی",
    "address": "مسیر پیاده روی جاماندگان اربعین",
    "services": "ظرفیت ۱۱۱۱۱",
    "phone": "09029825654"
  },
  {
    "name": "هیعت جوانان حضرت علی اصغر",
    "type": "پذیرایی",
    "address": "مسیر پیاده روی جاماندگان اربعین",
    "services": "ظرفیت None",
    "phone": "09029825654"
  },
  {
    "name": "حوزه بسیج اصناف ، کسبه و بازاریان شهرستان قرچک ",
    "type": "پذیرایی",
    "address": "مسیر پیاده روی جاماندگان اربعین",
    "services": "ظرفیت ۵۰۰۰",
    "phone": "۰۹۱۲۲۸۶۰۰۷۶"
  },
  {
    "name": "فرمانداری، بخشداری و دهیاری‌ها",
    "type": "پذیرایی",
    "address": "مسیر پیاده روی جاماندگان اربعین",
    "services": "ظرفیت ۵۰۰۰",
    "phone": "۰۹۱۲۵۷۹۴۲۲۰",
    "lat": 35.46200,
    "lng": 51.55749
  },
  {
    "name": "دلباختگان حضرت فاطمه(ص)",
    "type": "پذیرایی",
    "address": "مسیر پیاده روی جاماندگان اربعین",
    "services": "ظرفیت 1000",
    "phone": "09396936003"
  },
  {
    "name": "موکب فاطمة الزهرا",
    "type": "پذیرایی",
    "address": "مسیر پیاده روی جاماندگان اربعین",
    "services": "ظرفیت 1000",
    "phone": "09396936003"
  },
  {
    "name": "مردمی",
    "type": "پذیرایی",
    "address": "مسیر پیاده روی جاماندگان اربعین",
    "services": "ظرفیت ۳۵۰۰",
    "phone": "۰۹۳۷۲۴۲۴۱۲۱۳"
  },
  {
    "name": "جهادی ",
    "type": "پذیرایی",
    "address": "مسیر پیاده روی جاماندگان اربعین",
    "services": "ظرفیت ۳۵۰۰",
    "phone": "۰۹۳۷۲۴۲۴۱۲۱۳"
  },
  {
    "name": "مردمی",
    "type": "پذیرایی",
    "address": "مسیر پیاده روی جاماندگان اربعین",
    "services": "ظرفیت ۳۵۰۰",
    "phone": "۰۹۳۷۲۴۲۴۱۲۱۳"
  },
  {
    "name": "مردمی",
    "type": "پذیرایی",
    "address": "مسیر پیاده روی جاماندگان اربعین",
    "services": "ظرفیت ۳۵۰۰نفر",
    "phone": "۰۹۳۷۲۴۲۱۲۱۳"
  },
  {
    "name": "حوزه علمیه خواهران شهرستان قرچک ",
    "type": "فرهنگی",
    "address": "مسیر پیاده روی جاماندگان اربعین",
    "services": "ظرفیت 500",
    "phone": "09366506011"
  },
  {
    "name": "گروه جهادی اباصالح",
    "type": "پذیرایی",
    "address": "مسیر پیاده روی جاماندگان اربعین",
    "servi
